In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {'a':1, 'b':2, 'c':3, 'd':4}
s = pd.Series(data)
s

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
data = [0, 1, 2, 3, 4]
s = pd.Series(data, index=['a','b','c','d','e'])
s

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [9]:
s.values

print(type(s.values))

print(s.values.tolist())

<class 'numpy.ndarray'>
[0, 1, 2, 3, 4]

In [6]:
s.keys

<bound method Series.keys of a    0
b    1
c    2
d    3
e    4
dtype: int64>

In [10]:
s[0:2]

a    0
b    1
dtype: int64

In [11]:
s['e']

4

In [15]:
import pandas as pd

list_data = ['item_01', 'item_02', 3, 'item_04', 'item_05', True, 'item_07']

df = pd.DataFrame(list_data)

print(df.head())
print('----')
print(df.head(2))
print('----')
print(df.head(-5))
print('----')
print(df.tail(3))

         0
0  item_01
1  item_02
2        3
3  item_04
4  item_05
----
         0
0  item_01
1  item_02
----
         0
0  item_01
1  item_02
----
         0
4  item_05
5     True
6  item_07

In [25]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'A':1,'B':pd.Timestamp('20190102'),'C':pd.Series(1, index=range(4), dtype='float32'),
    'D':(np.array([3] * 4, dtype='int32')),'E':2
})

df.describe()

         A    C    D    E
count  4.0  4.0  4.0  4.0
mean   1.0  1.0  3.0  2.0
std    0.0  0.0  0.0  0.0
min    1.0  1.0  3.0  2.0
25%    1.0  1.0  3.0  2.0
50%    1.0  1.0  3.0  2.0
75%    1.0  1.0  3.0  2.0
max    1.0  1.0  3.0  2.0

In [26]:
df.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [27]:
# 데이터 타입 변경

import pandas as pd

df = pd.DataFrame({'col1':[1, 2], 'col2':[3, 4]})
df

   col1  col2
0     1     3
1     2     4

In [28]:
df = df.astype('float')
print(df.dtypes)

col1    float64
col2    float64
dtype: object

In [30]:
df = df.astype({'col1':'int'})
print(df.dtypes)

col1      int64
col2    float64
dtype: object

In [39]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'A':1,'B':pd.Timestamp('20190102'),'C':pd.Series(1, index=range(4), dtype='float32'),
    'D':np.array([3] * 4, dtype='int32'),'E':['test', 'train', 'test', 'test']
})

df.head()

   A          B    C  D      E
0  1 2019-01-02  1.0  3   test
1  1 2019-01-02  1.0  3  train
2  1 2019-01-02  1.0  3   test
3  1 2019-01-02  1.0  3   test

In [35]:
df.drop(['A'], axis=1)

           B    C  D      E
0 2019-01-02  1.0  3   test
1 2019-01-02  1.0  3  train
2 2019-01-02  1.0  3   test
3 2019-01-02  1.0  3   test

In [37]:
df['K'] = np.arange(1, 5)
df

   A          B    C  D      E  K
0  1 2019-01-02  1.0  3   test  1
1  1 2019-01-02  1.0  3  train  2
2  1 2019-01-02  1.0  3   test  3
3  1 2019-01-02  1.0  3   test  4

In [40]:
df[df.A < 0]

Empty DataFrame
Columns: [A, B, C, D, E]
Index: []

In [41]:
import pandas as pf
import numpy as np
from numpy.random import randn

In [42]:
np.random.seed(1234)

In [43]:
df = pd.DataFrame(randn(10,2), columns=['A','B'])

In [44]:
df[df.A > df.B]

          A         B
0  0.471435 -1.190976
1  1.432707 -0.312652
3  0.859588 -0.636524
4  0.015696 -2.242685
5  1.150036  0.991946
6  0.953324 -2.021255
8  0.405453  0.289092
9  1.321158 -1.546906

In [45]:
df[df.A > df.B]['B']

0   -1.190976
1   -0.312652
3   -0.636524
4   -2.242685
5    0.991946
6   -2.021255
8    0.289092
9   -1.546906
Name: B, dtype: float64

In [46]:
df[(df.A > df.B) & (df.A>df.B)]

          A         B
0  0.471435 -1.190976
1  1.432707 -0.312652
3  0.859588 -0.636524
4  0.015696 -2.242685
5  1.150036  0.991946
6  0.953324 -2.021255
8  0.405453  0.289092
9  1.321158 -1.546906

In [47]:
df.loc[0:7, ['A']]

          A
0  0.471435
1  1.432707
2 -0.720589
3  0.859588
4  0.015696
5  1.150036
6  0.953324
7 -0.334077

In [48]:
df.loc[:, ['A']]

          A
0  0.471435
1  1.432707
2 -0.720589
3  0.859588
4  0.015696
5  1.150036
6  0.953324
7 -0.334077
8  0.405453
9  1.321158

In [49]:
df.loc[3:3]

          A         B
3  0.859588 -0.636524

In [50]:
df.iloc[0:7, [0]]

          A
0  0.471435
1  1.432707
2 -0.720589
3  0.859588
4  0.015696
5  1.150036
6  0.953324